In [75]:
import pandas as pd

In [76]:

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [77]:
lst = [1, 2, 3, 4, 5]
df = pd.DataFrame(lst)
df

   0
0  1
1  2
2  3
3  4
4  5

In [78]:
lst = [1, 2, 3, 4, 5]
df = pd.DataFrame([lst])
df

   0  1  2  3  4
0  1  2  3  4  5

In [79]:
lst = [[1,2,3,4,5], [11,12,13,14,15]]
df = pd.DataFrame(lst)
df

    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15

In [80]:
a = [{'a':5, 'b':7, 'c':9, 'd':2},
     {'a':4, 'b':8, 'c':19, 'd':12}]        # Dictionary Keys represents Column names
df = pd.DataFrame(a)
df

   a  b   c   d
0  5  7   9   2
1  4  8  19  12

In [81]:
b = {'RollNo.': pd.Series([1,2,3,4,5]),
     'Maths': pd.Series([67,89,23,90,56]),
     'Physics': pd.Series([12,98,44,90,78])}

df = pd.DataFrame(b)
df

   RollNo.  Maths  Physics
0        1     67       12
1        2     89       98
2        3     23       44
3        4     90       90
4        5     56       78